{
  "banner": {
    "title": "about me",
    "subtitle": "Hey, I'm Bruno Genaro CEO of WebSolutionsFL",
    "backgroundColor": "#22C55E",
    "textGradient": "from-green-500 to-emerald-600"
  },
  "text": "Hey, I'm Bruno Genaro. I started developing websites back in 2003, working in a music portal called ZineKaos.com.br (RIP), which you still can see its last version created in 2005. I'm currently the CEO of WebSolutionsFL, where we offer consultancy and outsourcing work focused mainly on JavaScript/TypeScript (React, React Native, and Node.js). I'm originally from Brazil, and now I live in Orlando (Florida). When I'm not coding, you can see me at the gym, concerts, skateboarding, playing drums, reading books, taking online courses, producing events, or enjoying the fantastic Florida weather with my beautiful two daughters, Sophie and Stella.",
  "downloadImg": "/assets/image/bitmap/bruno/bruno.jpeg",
  "fileName": "BrunoGenaroProfile",
  "career": [
    {
      "title": "Chief Executive Officer",
      "description": "Worked as Developer and Managing Developers in multiple projects from small to large clients.",
      "company": {
        "name": "WebSolutionsFL",
        "url": "https://www.websolutionsfl.com/"
      },
      "date": "mar 2013 - present"
    },
    {
      "title": "Senior Software Engineer",
      "description": "Developed the Developers Documentation and Tools to help devs use their API. Worked with technologies such as React.js, Next.js, Node.js, Apollo, GraphQL, Styled Components and Cypress.io.",
      "company": { "name": "Mapped", "url": "https://www.mapped.com/" },
      "date": "dez 2020 - present"
    },
    {
      "title": "Senior Software Engineer",
      "description": "Developed the new Webex Marketplace (App Hub) to increase customer engagement of Webex Collaboration apps through its platform adoption. Responsible for key product features in Webex Teams enterprise collaboration app, launch, and growth of Webex App store. Developed the new Developer Portal. I was responsible for all the UI/UX and also development integration for the Blog and API Changelog.",
      "company": { "name": "Cisco Sytems", "url": "https://www.cisco.com/" },
      "date": "mai 2016 - nov 2020"
    },
    {
      "title": "Lead Front-End / Mobile App Developer",
      "description": "Managed the Front-End team focusing on workow improvements and best practices. Developed multiple native mobile applications (Android and iOS) using Appcelerator Titanium and Alloy framework. Managed and maintained mid to large-scale JavaScript applications using BackboneJS and AngularJS. Integrated web and mobile applications with RESTful APIs. Integrated third-party APIs, such as Google Maps, Facebook and Twitter. Developed custom websites using Wordpress. Developed custom Themes, Plugins and Post Types/Fields for Wordpress. Managed and maintained PHP websites using MySQL database. Created user interfaces from strict requirements with JavaScript, jQuery, HTML5, CSS3, Sass, Bootstrap and Foundation. Used Node.js solutions for development workflow using NPM, Yeoman, Bower Grunt and Gulp. Implemented new workow processes including GruntJS, Sass, and JavaScript linters.",
      "company": { "name": "Concepta", "url": "https://www.conceptatech.com/" },
      "date": "mai 2013 - mai 2016"
    },
    {
      "title": "Lead Full Stack Developer",
      "description": "",
      "company": {
        "name": "WebServConsulting",
        "url": "http://www.webservconsulting.com/"
      },
      "date": "dez 2011 - jan 2013"
    },
    {
      "title": "Web Developer",
      "description": "",
      "company": {
        "name": "Triade Tecnologia",
        "url": "https://www.triadetecnologia.com.br/"
      },
      "date": "mar 2008 - mar 2011 "
    }
  ]
}
